<details ><summary>plan for staging 2025-05-10 03:16:06 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project aamini11/imdbgraph-infra#staging has been locked by PR #1
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # module.app.azurerm_federated_identity_credential.this must be replaced
-/+ resource "azurerm_federated_identity_credential" "this" {
      ~ id                  = "/subscriptions/331269d5-143f-4246-b389-9c1f41bb5882/resourceGroups/rg-imdbgraph-staging/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azure-alb-identity/federatedIdentityCredentials/azure-alb-identity" -> (known after apply)
      ~ issuer              = "https://eastus2.oic.prod-aks.azure.com/1eb98549-3952-4fc7-b783-da109d29a89a/8fc11b57-47eb-4a8d-8c56-5c82cb1b7fb9/" -> (known after apply)
        name                = "azure-alb-identity"
      ~ parent_id           = "/subscriptions/331269d5-143f-4246-b389-9c1f41bb5882/resourceGroups/rg-imdbgraph-staging/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azure-alb-identity" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.app.azurerm_kubernetes_cluster.this must be replaced
-/+ resource "azurerm_kubernetes_cluster" "this" {
      - cost_analysis_enabled               = false -> null
      ~ current_kubernetes_version          = "1.31.7" -> (known after apply)
      ~ fqdn                                = "imdbgraph-api-w0hndw0y.hcp.eastus2.azmk8s.io" -> (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      ~ id                                  = "/subscriptions/331269d5-143f-4246-b389-9c1f41bb5882/resourceGroups/rg-imdbgraph-staging/providers/Microsoft.ContainerService/managedClusters/aks-imdbgraph" -> (known after apply)
      ~ kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      ~ kubernetes_version                  = "1.31" -> (known after apply)
      - local_account_disabled              = false -> null
      ~ location                            = "eastus2" -> "eastus" # forces replacement
        name                                = "aks-imdbgraph"
      ~ node_resource_group                 = "MC_rg-imdbgraph-staging_aks-imdbgraph_eastus2" -> (known after apply)
      ~ node_resource_group_id              = "/subscriptions/331269d5-143f-4246-b389-9c1f41bb5882/resourceGroups/MC_rg-imdbgraph-staging_aks-imdbgraph_eastus2" -> (known after apply)
      ~ oidc_issuer_url                     = "https://eastus2.oic.prod-aks.azure.com/1eb98549-3952-4fc7-b783-da109d29a89a/8fc11b57-47eb-4a8d-8c56-5c82cb1b7fb9/" -> (known after apply)
      ~ portal_fqdn                         = "imdbgraph-api-w0hndw0y.portal.hcp.eastus2.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      - tags                                = {} -> null
        # (11 unchanged attributes hidden)

      ~ default_node_pool {
          - auto_scaling_enabled         = false -> null
          - fips_enabled                 = false -> null
          - host_encryption_enabled      = false -> null
          ~ kubelet_disk_type            = "OS" -> (known after apply)
          - max_count                    = 0 -> null
          ~ max_pods                     = 250 -> (known after apply)
          - min_count                    = 0 -> null
            name                         = "agentpool"
          ~ node_labels                  = {} -> (known after apply)
          - node_public_ip_enabled       = false -> null
          - only_critical_addons_enabled = false -> null
          ~ orchestrator_version         = "1.31" -> (known after apply)
          ~ os_disk_size_gb              = 128 -> (known after apply)
          ~ os_sku                       = "Ubuntu" -> (known after apply)
          - tags                         = {} -> null
          + workload_runtime             = (known after apply)
          - zones                        = [] -> null
            # (7 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "d089b02c-dcb4-4551-8376-b4946ae40933" -> (known after apply)
          ~ tenant_id    = "1eb98549-3952-4fc7-b783-da109d29a89a" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      - kubelet_identity {
          - client_id                 = "66e4faae-a86a-492b-8704-8282ba3570c2" -> null
          - object_id                 = "d7030963-996b-4135-adc8-a580d4de6e0c" -> null
          - user_assigned_identity_id = "/subscriptions/331269d5-143f-4246-b389-9c1f41bb5882/resourceGroups/MC_rg-imdbgraph-staging_aks-imdbgraph_eastus2/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-imdbgraph-agentpool" -> null
        }

      ~ network_profile {
          ~ dns_service_ip      = "10.0.0.10" -> (known after apply)
          ~ ip_versions         = [
              - "IPv4",
            ] -> (known after apply)
          + network_mode        = (known after apply)
          ~ network_policy      = "cilium" -> (known after apply)
          ~ pod_cidrs           = [
              - "192.168.0.0/16",
            ] -> (known after apply)
          ~ service_cidr        = "10.0.0.0/16" -> (known after apply)
          ~ service_cidrs       = [
              - "10.0.0.0/16",
            ] -> (known after apply)
            # (6 unchanged attributes hidden)

          - load_balancer_profile {
              - backend_pool_type           = "NodeIPConfiguration" -> null
              - effective_outbound_ips      = [
                  - "/subscriptions/331269d5-143f-4246-b389-9c1f41bb5882/resourceGroups/MC_rg-imdbgraph-staging_aks-imdbgraph_eastus2/providers/Microsoft.Network/publicIPAddresses/d8b77845-7ae9-4fd9-9bf8-d9507d011b5d",
                ] -> null
              - idle_timeout_in_minutes     = 0 -> null
              - managed_outbound_ip_count   = 1 -> null
              - managed_outbound_ipv6_count = 0 -> null
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              - outbound_ports_allocated    = 0 -> null
            }
        }

      - windows_profile {
          - admin_username = "azureuser" -> null
        }
    }

  # module.app.azurerm_resource_group.main must be replaced
-/+ resource "azurerm_resource_group" "main" {
      ~ id       = "/subscriptions/331269d5-143f-4246-b389-9c1f41bb5882/resourceGroups/rg-imdbgraph-staging" -> (known after apply)
      ~ location = "eastus2" -> "eastus" # forces replacement
        name     = "rg-imdbgraph-staging"
      - tags     = {} -> null
    }

  # module.app.azurerm_role_assignment.reader must be replaced
-/+ resource "azurerm_role_assignment" "reader" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/331269d5-143f-4246-b389-9c1f41bb5882/resourceGroups/MC_rg-imdbgraph-staging_aks-imdbgraph_eastus2/providers/Microsoft.Authorization/roleAssignments/7b1bcfcb-58c6-5f8c-fa67-5728a1451334" -> (known after apply)
      ~ name                             = "7b1bcfcb-58c6-5f8c-fa67-5728a1451334" -> (known after apply)
      ~ principal_id                     = "99f00263-6de0-4a14-96ca-474d5a55c6d7" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/331269d5-143f-4246-b389-9c1f41bb5882/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      ~ scope                            = "/subscriptions/331269d5-143f-4246-b389-9c1f41bb5882/resourceGroups/MC_rg-imdbgraph-staging_aks-imdbgraph_eastus2" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.app.azurerm_user_assigned_identity.workload_id must be replaced
-/+ resource "azurerm_user_assigned_identity" "workload_id" {
      ~ client_id           = "52e3527b-1e2d-4059-ad3e-fbb1b0023764" -> (known after apply)
      ~ id                  = "/subscriptions/331269d5-143f-4246-b389-9c1f41bb5882/resourceGroups/rg-imdbgraph-staging/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azure-alb-identity" -> (known after apply)
      ~ location            = "eastus2" -> "eastus" # forces replacement
        name                = "azure-alb-identity"
      ~ principal_id        = "99f00263-6de0-4a14-96ca-474d5a55c6d7" -> (known after apply)
      - tags                = {} -> null
      ~ tenant_id           = "1eb98549-3952-4fc7-b783-da109d29a89a" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  ~ workload_identity_client_id = "52e3527b-1e2d-4059-ad3e-fbb1b0023764" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────
```
</details>

</details>